##Задача 1

In [114]:
import pandas as pd
import numpy as np

author = pd.DataFrame({'author_id':[1, 2, 3],'author_name':['Тургенев', 'Чехов', 'Островский']})
books = pd.DataFrame({'author_id':[1, 1, 1, 2, 2, 3, 3], 'book_title':['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],'price':[450, 300, 350, 500, 450, 370, 290]})

##Задача 2

In [115]:
author_price = pd.merge(author,books,on='author_id',how='inner')
author_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

##Задача 3

In [116]:
top5=author_price.sort_values('price',axis=0,ascending=False).head(5)
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

##Задача 4

In [117]:
max_price = author_price.groupby('author_id').max().drop(columns='book_title').rename(columns={'price':'MAX price'})
max_price = max_price.drop(columns='author_name')
min_price = author_price.groupby('author_id').min().drop(columns='book_title').rename(columns={'price':'MIN price'})
mean_price = author_price.groupby('author_id').mean().rename(columns={'price':'MEAN price'})
mean_price = mean_price.astype({'MEAN price':'int32'})
max_min_price = min_price.merge(max_price,on='author_id',how='inner')
authors_stat = max_min_price.merge(mean_price,on='author_id',how='inner')

authors_stat

          author_name  MIN price  MAX price  MEAN price
author_id
1            Тургенев        300        450         366
2               Чехов        450        500         475
3          Островский        290        370         330

##Задача 5

In [125]:
pd.concat
author_price_cover=pd.concat([author_price,pd.DataFrame({'cover':['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']})],axis=1)
#author_price_cover
book_info=pd.pivot_table(author_price_cover, values='price',index='author_name',columns='cover',aggfunc=np.sum,fill_value=0)
book_info.to_pickle('book_info.pkl')
book_info2 = pd.read_pickle('book_info.pkl')
book_info2

cover        мягкая  твердая
author_name
Островский      660        0
Тургенев        650      450
Чехов             0      950